//---------------------------------------------------------
//Rankingクラス (未完成)
//
//Solrの検索時にdebugQuery=onにし、ランキング計算の情報を得る
//その内容からランキングを修正するプログラムである
//---------------------------------------------------------
package solr;

public class Ranking {

	static String[] _data;

	/**----------------------------------------------------
	 * コンストラクタ
	 * --------------------------------------------------*/
	public Ranking() {

	}

	/**----------------------------------------------------
	 * debugDataメソッド (データを分割して保存)
	 * ----------------------------------------------------
	 * @param data
	 * --------------------------------------------------*/
	public void debugData(String data) {
		_data = data.split("\n");
		for (int i = 1; i < _data.length; i++) {
			System.out.println(_data[i].trim());
		}
	}

	/**----------------------------------------------------
	 * idfメソッド (グローバルIDFを付けるための計算式)
	 * ----------------------------------------------------
	 * @param maxDocs
	 * @param docFreq
	 * @return
	 * --------------------------------------------------*/
	public float idf(int maxDocs, int docFreq) {
		return (float) (Math.log(maxDocs / (double) (docFreq + 1)) + 1);
	}

	/**----------------------------------------------------
	 *tfメソッド
	 *-----------------------------------------------------
	 * @param docfreq
	 * @return
	 * --------------------------------------------------*/
	public float tf(int docfreq) {
		return (float) Math.sqrt((double) docfreq);
	}

	/**----------------------------------------------------
	 * scoreメソッド (スコアを返す)
	 * ----------------------------------------------------
	 * @return
	 * --------------------------------------------------*/
	public float score() {
		return 0.0f;
	}
}
