//---------------------------------------------------------
//Rankingクラス
//
//Solrの検索時にdebugQuery=onにし、ランキング計算の情報を得る
//その内容からランキングを修正するプログラムである
//---------------------------------------------------------
package solr;

public class Ranking {

	/**----------------------------------------------------
	 * コンストラクタ
	 * --------------------------------------------------*/
	public Ranking() {

	}


	/**----------------------------------------------------
	 * idfメソッド(グローバルIDFを付けるための計算式)
	 * ----------------------------------------------------
	 * @param maxDocs
	 * @param docFreq
	 * @return
	 * --------------------------------------------------*/
	public float idf(int maxDocs, int docFreq) {
		return (float) (Math.log(maxDocs / (double) (docFreq + 1)) + 1);
	}
}
