//---------------------------------------------------------
//Managerクラス
//
//LSEノードを管理するクラス（最終的には、ServletでREST形式で使えるようにする）
//---------------------------------------------------------
package master;

public class Master {

	//-----------------------------------------------------
	//コンストラクタ
	//-----------------------------------------------------

	/**
	 * コンストラクタ
	 */
	public Master() {

	}

	//-----------------------------------------------------
	//制御用メソッド
	//-----------------------------------------------------

	/**
	 * attachメソッド (新規ノード追加した時の処理)
	 *
	 * @return
	 */
	public String attach() {
		return null;
	}

	/**
	 * dettachメソッド (１つのノードがダウンした時の処理)
	 *
	 * @return
	 */
	public String dettach() {
		return null;
	}

	/**
	 * restoreメソッド (ダウンしたノードを再起動させた時の処理)
	 *
	 * @return
	 */
	public String restore() {
		return null;
	}
}